  ### Deployment Results ✅

  **jcetina** successfully deployed branch `jcetina/bastion-vault` to **production**

  <details><summary>Show Results</summary>

  ```terraform
[command]/home/runner/work/_temp/4b36667a-9335-4e4c-b5bc-0599347f61c6/terraform-bin apply -no-color -auto-approve -compact-warnings

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

# module.eastus["eastus"].azurerm_subnet.gateway will be created
+ resource "azurerm_subnet" "gateway" {
    + address_prefixes                               = [
        + "10.0.0.0/28",
      ]
    + enforce_private_link_endpoint_network_policies = false
    + enforce_private_link_service_network_policies  = false
    + id                                             = (known after apply)
    + name                                           = "GatewaySubnet"
    + resource_group_name                            = "org-jcetina-repo-baklava-rg"
    + virtual_network_name                           = "azure-eastus"
  }

# module.eastus["eastus"].azurerm_virtual_network.vnet will be created
+ resource "azurerm_virtual_network" "vnet" {
    + address_space       = [
        + "10.0.0.0/16",
      ]
    + dns_servers         = (known after apply)
    + guid                = (known after apply)
    + id                  = (known after apply)
    + location            = "eastus"
    + name                = "azure-eastus"
    + resource_group_name = "org-jcetina-repo-baklava-rg"
    + subnet              = (known after apply)
  }

# module.eastus["westus"].azurerm_subnet.gateway will be created
+ resource "azurerm_subnet" "gateway" {
    + address_prefixes                               = [
        + "10.1.0.0/28",
      ]
    + enforce_private_link_endpoint_network_policies = false
    + enforce_private_link_service_network_policies  = false
    + id                                             = (known after apply)
    + name                                           = "GatewaySubnet"
    + resource_group_name                            = "org-jcetina-repo-baklava-rg"
    + virtual_network_name                           = "azure-westus"
  }

# module.eastus["westus"].azurerm_virtual_network.vnet will be created
+ resource "azurerm_virtual_network" "vnet" {
    + address_space       = [
        + "10.1.0.0/16",
      ]
    + dns_servers         = (known after apply)
    + guid                = (known after apply)
    + id                  = (known after apply)
    + location            = "westus"
    + name                = "azure-westus"
    + resource_group_name = "org-jcetina-repo-baklava-rg"
    + subnet              = (known after apply)
  }

Plan: 4 to add, 0 to change, 0 to destroy.
module.eastus["westus"].azurerm_virtual_network.vnet: Creating...
module.eastus["eastus"].azurerm_virtual_network.vnet: Creating...
module.eastus["westus"].azurerm_virtual_network.vnet: Creation complete after 5s [id=/subscriptions/ad3b85d9-1354-4383-a30c-6383716082e4/resourceGroups/org-jcetina-repo-baklava-rg/providers/Microsoft.Network/virtualNetworks/azure-westus]
module.eastus["eastus"].azurerm_virtual_network.vnet: Creation complete after 5s [id=/subscriptions/ad3b85d9-1354-4383-a30c-6383716082e4/resourceGroups/org-jcetina-repo-baklava-rg/providers/Microsoft.Network/virtualNetworks/azure-eastus]
module.eastus["eastus"].azurerm_subnet.gateway: Creating...
module.eastus["westus"].azurerm_subnet.gateway: Creating...
module.eastus["westus"].azurerm_subnet.gateway: Creation complete after 5s [id=/subscriptions/ad3b85d9-1354-4383-a30c-6383716082e4/resourceGroups/org-jcetina-repo-baklava-rg/providers/Microsoft.Network/virtualNetworks/azure-westus/subnets/GatewaySubnet]
module.eastus["eastus"].azurerm_subnet.gateway: Creation complete after 5s [id=/subscriptions/ad3b85d9-1354-4383-a30c-6383716082e4/resourceGroups/org-jcetina-repo-baklava-rg/providers/Microsoft.Network/virtualNetworks/azure-eastus/subnets/GatewaySubnet]

Apply complete! Resources: 4 added, 0 changed, 0 destroyed.
```

  </details>